{
    "version": "https://jsonfeed.org/version/1",
    "title": "Home Office Politics | Make Money Save Money in 2021",
    "description": "",
    "home_page_url": "https://homeofficepolitics.com",
    "feed_url": "https://homeofficepolitics.com/feed.json",
    "user_comment": "",
    "icon": "https://homeofficepolitics.com/media/website/Home-Office-Politics-2.png",
    "author": {
        "name": "Staff"
    },
    "items": [
        {
            "id": "https://homeofficepolitics.com/10-creative-majors-degrees-educations-make-money/",
            "url": "https://homeofficepolitics.com/10-creative-majors-degrees-educations-make-money/",
            "title": "10 Creative Majors, Degrees, or Educations that Make Money",
            "summary": "You have heard the horror stories of the “starving artist” who just wants to pursue their passion but can’t afford to pay their rent, much less support his family. How does an artistic, creative person like you make sure you won’t go hungry pursuing your passion? How can you have fun learning, creating, and expressing yourself while also earning a living? If you are asking questions like these, you do have a valid and meaningful concern. While it’s true that a degree per-se does not qualify one for such jobs as much as hard smart work afterward does, earring the right degree or getting the right education does give you an early head start. There is power and money making opportunities with creative and artistic thinking. Education and training is like getting compounding interest on your money that continues to build and grow and pay you throughout your entire life. (share with the world) We took the time to research the most and high-paying artistic creative jobs, the creative majors, creative educations, and creative degrees that are behind the best creative and artistic jobs. Knowing your desired destination and each respective starting point, can lead to making reliable and realistic&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/19/creative-majors-design-education-make-money.webp",
            "author": {
                "name": "Staff"
            },
            "tags": [
                   "Make Money",
                   "Creative"
            ],
            "date_published": "2021-05-17T12:32:53-06:00",
            "date_modified": "2021-05-17T16:03:09-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/how-creative-thinking-leads-to-making-more-money/",
            "url": "https://homeofficepolitics.com/how-creative-thinking-leads-to-making-more-money/",
            "title": "How Improved Creative Thinking Leads to Making More Money",
            "summary": "I have been in the business of creative communications for more than 30 years. I started as an ad copywriter and now wear many different creative hats: I became an account manager, a layout artist, a creative director, a media planner, and a marketing communications consultant. I have learned how being more creative can lead to more opportunities to make money. So, whenever there’s an opportunity to improve my creativity and learn from new experiences, count me in. You might say that I am a creative person, and creative thinking comes naturally to me. But is creativity confined to people like me? What about people who don't consider themselves \"creative\" or artists? Can’t they be creative too? This is not an idle question that just stops at self-reflection. We (you and me) need to understand our creative gifts and the way that the creative process works, because improved creative thinking can lead us to making more money. (share with the world) There are real opportunities for creative people, especially professionals who have creative majors or degrees or education to make money. Many people think that creativity is something you have or you don’t. Thinking that only a certain people are&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/18/creative-thinking-making-money-960-50.webp",
            "author": {
                "name": "Staff"
            },
            "tags": [
                   "Make Money",
                   "Creative"
            ],
            "date_published": "2021-05-17T10:19:20-06:00",
            "date_modified": "2021-05-17T18:15:08-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/high-level-side-hustle-assessment/",
            "url": "https://homeofficepolitics.com/high-level-side-hustle-assessment/",
            "title": "High-Level Side Hustle Assessment",
            "summary": " We think it's a really good idea for you to start a side hustle, your own company, and an independent way of making money and growing your wealth.&nbsp; But before you begin, take our high-level side hustle assessment to get an idea of how read you are. We'll tell you if you're in a good position or not to get started. After you take the side hustle assessment for entrepreneurs then contact us so we can help you get started. ",
            "image": "https://homeofficepolitics.com/media/posts/15/make-money-entrepreneur-960.webp",
            "author": {
                "name": "Staff"
            },
            "tags": [
                   "Side Hustle",
                   "Resources"
            ],
            "date_published": "2021-04-24T16:55:57-06:00",
            "date_modified": "2021-05-17T11:45:57-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/side-hustle-assessment/",
            "url": "https://homeofficepolitics.com/side-hustle-assessment/",
            "title": "High-level Side Hustle Assessment Grades",
            "summary": " The Home Office Politics side hustle assessment is intended to help you as an entrepreneur to understand your preparedness to start--or continue with--a side hustle. Please complete (or retake) the high-level side hustle assessment for entrepreneurs if you have not already. The results of this evaluation is intended for informational purposes only; but knowledge is power. Instructions:&nbsp;After you completed the 60-second high-level side hustle assessment for entrepreneurs, you were redirected to this page and to the correct section that applies to your own evaluation. We also emailed a copy of your score to your valid email address that you provided at the end of the survey. You can reference that email if necessary to find your score again. You can also refresh the page and you will be re-directed back to your score section. These grades range from 0-31, zero being low and 31 being high. An excellent grade are ranges from 23-31 (maximum). 16-22 10-15 3-9 0-2 Thank you for taking the high-level side hustle assessment for entrepreneurs. You are on the right path toward fulfilling your dreams of being an entrepreneur, starting and running your own business.&nbsp; Contact us today for advice about how you can keep&hellip;",
            "author": {
                "name": "Staff"
            },
            "tags": [
                   "Resources"
            ],
            "date_published": "2021-04-24T14:06:56-06:00",
            "date_modified": "2021-04-25T00:39:36-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/about/",
            "url": "https://homeofficepolitics.com/about/",
            "title": "About Us",
            "summary": " We've been working online since 2002. We begun doing technical support and design services for an early ecommerce platform. Our first full-time work from home gig started in 2011 and we've been doing this ever since. We now manage five brands with a few dozen contractors. We've always thought we should chronicle our lives and experience working from home. We've had challenges, fun times, and love the puns all along the way. Follow us and we'll introduce you to how you can work from home on your own side hustle, time gig working for someone else, and save money too. ",
            "image": "https://homeofficepolitics.com/media/posts/1/about-home-office-politics-960-30-short.webp",
            "author": {
                "name": "Staff"
            },
            "tags": [
                   "About"
            ],
            "date_published": "2021-04-14T13:56:30-06:00",
            "date_modified": "2021-04-24T11:25:45-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/about-you/",
            "url": "https://homeofficepolitics.com/about-you/",
            "title": "About You",
            "summary": " We want to know more about you. Tell us what you want to achieve? Do you want to make more more money, save money, start a side hustle or get side gig? What challenges are you experiencing? What would help you achieve these goals? If we can help, we will get back to you with more information and resources. Loading…",
            "image": "https://homeofficepolitics.com/media/posts/2/about-you-960-50.webp",
            "author": {
                "name": "Staff"
            },
            "tags": [
                   "Resources"
            ],
            "date_published": "2021-04-14T13:55:52-06:00",
            "date_modified": "2021-04-24T11:29:37-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/contact/",
            "url": "https://homeofficepolitics.com/contact/",
            "title": "Contact Us",
            "summary": " Send us an email by completing the form below. No spam please. Loading… ",
            "image": "https://homeofficepolitics.com/media/posts/3/contact-hop-960.webp",
            "author": {
                "name": "Staff"
            },
            "tags": [
                   "About"
            ],
            "date_published": "2021-04-14T13:55:10-06:00",
            "date_modified": "2021-04-24T11:27:17-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/tcp/",
            "url": "https://homeofficepolitics.com/tcp/",
            "title": "Terms, Conditions, Privacy, etc.",
            "summary": " The terms \"us\", \"we\", \"HOP\", etc. represent Home Office Politics. The terms \"you\", \"viewer\", \"visitor\", etc. represent you. Our service, tools and information is provided as-is with no warranty. We will do our best to provide you great information and tools and keep them available as much as possible. We reserve the right to limit access to our resources at our sole discretion.&nbsp; We reserve the right to use the content, data and tools at our disposal for our advantage as long as it is good and legal. Data provided to us via form submissions is used for customer service, assessment, and marketing purposes. The&nbsp;content on HomeOfficePolitics.com may contain affiliate links, meaning we&nbsp;receive payment if you decide to make a purchase or sign up through our links, at no cost to you. Please use our links to help support everything we are trying to do for you and our community. ",
            "image": "https://homeofficepolitics.com/media/posts/6/terms-conditions-privacy.jpg",
            "author": {
                "name": "Staff"
            },
            "tags": [
                   "About"
            ],
            "date_published": "2021-04-14T13:49:36-06:00",
            "date_modified": "2021-04-24T13:38:10-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/write-for-us/",
            "url": "https://homeofficepolitics.com/write-for-us/",
            "title": "Write for Us",
            "summary": " We love working with other authors and people experienced with making money, saving money, working from home, remote jobs, side hustles, side gigs and personal finance. Please complete this form if you have something you would like to contribute or if you want to work together. We love reciprocating links, articles, etc. Fees may apply. Don't get overwhelmed here, this is more common sense and is easy if you write quality content. Submit your content. Thank you. ",
            "image": "https://homeofficepolitics.com/media/posts/4/write-for-hop-960.webp",
            "author": {
                "name": "Staff"
            },
            "tags": [
                   "About"
            ],
            "date_published": "2021-04-06T12:07:49-06:00",
            "date_modified": "2021-04-25T00:35:14-06:00"
        }
    ]
}
