{
    "version": "https://jsonfeed.org/version/1",
    "title": "Home Office Politics",
    "description": "",
    "home_page_url": "https://homeofficepolitics.com",
    "feed_url": "https://homeofficepolitics.com/feed.json",
    "user_comment": "",
    "icon": "https://homeofficepolitics.com/media/website/Home-Office-Politics-2.png",
    "author": {
        "name": "Garth"
    },
    "items": [
        {
            "id": "https://homeofficepolitics.com/personalized-list-side-hustle-ideas/",
            "url": "https://homeofficepolitics.com/personalized-list-side-hustle-ideas/",
            "title": "How to Get Your Personalized List of Side Hustle Ideas",
            "summary": "So much has been written about side hustle ideas that we can end up with a list of possible hustles that we can do. While all these are helpful for us who want to earn extra money, it would be great to dig deeper and find out more about what makes a certain side hustle popular. How do we find side hustle income ideas that fit our skills? Then, after months of doing them on the side, when do we consider going full-time in doing side hustle? Yes, you can have a full-time side hustle! I have met more than a handful of people doing many side hustle business ideas which they eventually made as their primary source of livelihood. Because of all the things that they can do, some of them have been called Jack (or Jill)-of-all-Trades, but hey, they earn more than your usual 9-to-5 employee! More on that later. But first, let’s deal with where to look for side hustles and come up with side hustle ideas that can help us earn extra money. ☝🏽 back to top. A quick search online will lead you to the best job search sites like Indeed, LinkedIn, Glassdoor, Google for&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/46/personalized-list-side-hustle-ideas.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Side Hustle"
            ],
            "date_published": "2021-09-03T11:18:12-06:00",
            "date_modified": "2021-09-03T11:29:03-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/15-true-real-estate-side-hustles/",
            "url": "https://homeofficepolitics.com/15-true-real-estate-side-hustles/",
            "title": "15 True Real Estate Side Hustles",
            "summary": "Real estate side hustles give you three ways to earn extra cash while working full-time or part-time in a different job. You can make money with a real estate side hustle as a: job, an investment, or a business venture. ☝🏽 back to top. In real estate side hustles, you can make money as a full-time employee or a part-time contractor. Do real estate agents make good money? You can make 2% to 8% from the sale, or an average of $50,000 a year. You would usually work under an umbrella company that provides you referrals, virtual assistants, and training. As a real estate agent, you connect buyers and sellers that should end in a real estate transaction. You earn your commission and find both partners through cold calls, networks with other real estate agents &amp; professionals, and websites or digital marketplaces that do trade in real estate. For real estate side hustles like these, you have the flexibility of time to determine whether you can do it as a day job, or just on evenings and weekends. You do need to get the right real estate license to become a real estate agent in your area. ☝🏽 back to&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/45/15-true-real-estate-side-hustles.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Side Hustle",
                   "Real Estate"
            ],
            "date_published": "2021-09-02T08:55:36-06:00",
            "date_modified": "2021-09-03T11:21:56-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/top-10-side-hustles-from-home/",
            "url": "https://homeofficepolitics.com/top-10-side-hustles-from-home/",
            "title": "Top 10 Side Hustles to Do From Home",
            "summary": "Since 2020, one working trend has emerged: combining working from your passion, and working from home. While it is difficult to make money pursuing a passion or hobby, working from home these days is very easy and possible---but now you can earn from both focusing on your interests and working from home. How much more challenging is it to do both at the same time? Indeed a side hustle from home is not a lottery win, but it’s not an unattainable goal, either. Ever since the COVID pandemic restricted travel, the importance of working from home is no longer traced to a desire for convenience, traffic avoidance, or taking care of one’s family. This shift because of health safety concerns has made working from home a viable option to grow toward profitability. ☝🏽 back to top. We will explore the top side hustles you can grow from home, and how to start and sustain them. Almost 30 years since the internet was introduced, many jobs either have online components or can entirely be done online already. When you think about side hustles from home, digital work is the first to come to mind. Here are the top digital options to&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/44/top-10-side-hustles-home.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Work From Home",
                   "Side Hustle"
            ],
            "date_published": "2021-08-31T14:43:42-06:00",
            "date_modified": "2021-09-02T10:14:01-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/weekend-jobs-columbia-south-carolina/",
            "url": "https://homeofficepolitics.com/weekend-jobs-columbia-south-carolina/",
            "title": "Weekend Jobs in Columbia, South Carolina",
            "summary": "Columbia is the capital city of South Carolina, a mixture of: families and people who come together to live there, young professionals and entrepreneurs, old retirees who are ready to enjoy their life to the fullest, small families looking to rent a house, and large families gathering there for reunions. People from all walks of life thrive in that city. One industry that flourishes in Columbia is agriculture, as there is a numerous amount of farmlands to grow wheat, corn, and cotton. Others are aerospace and tourism; though both are vastly different, they thrive together in the little city. If you want to make extra income, there are weekend jobs in Columbia, South Carolina that you can try out. Here are a few: ☝🏽 back to top. This job is widely needed in Columbia, South Carolina as it is listed several times on many job-searching websites. If you don’t have a family you need to see often, and your schedule is flexible, this driving gig is the greatest one on this list for you! As a truck driver, you would transport cargo across state lines over long distances to deliver the cargo to where it needs to go. You would&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/43/7-easy-weekend-jobs-columbia-south-carolina.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-08-30T17:13:46-06:00",
            "date_modified": "2021-08-30T17:20:15-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/weekend-jobs-new-jersey/",
            "url": "https://homeofficepolitics.com/weekend-jobs-new-jersey/",
            "title": "Weekend Jobs in New Jersey",
            "summary": "New Jersey, the cousin of New York City, lesser known, but still a sight to see. Home to people like Buddy Valastro (aka Cake Boss), Paul Rudd (aka Ant-Man), and Jon Bon Jovi, New Jersey is a beautiful city full of life. So many diverse lifestyles, ethnicities, and flavors can be found within its walls. Nicknamed the Garden State for it’s beautiful scenery and delicious food to eat, the name has stuck for years. Its economy is widely based on the service industry rather than goods manufacturing. Just take a look at the weekend jobs in New Jersey. Its economy has the most jobs in services like the local bank, wholesale, communications, engineering, and medicine. The industries that thrive within this state are technology as new tech is being produced every day; casinos; transportation (as many citizens are traveling across the city and to other cities around like Brookllyn and New York for work); and pharmaceuticals. All of these are respectable businesses to run and work in. There are many places to work in New Jersey. Here are several of the weekend jobs available in New Jersey. ☝🏽 back to top. If organization is your gig, then this is a&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/42/9-easy-weekend-jobs-new-jersey.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-08-30T16:50:00-06:00",
            "date_modified": "2021-08-30T17:15:40-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/weekend-jobs-new-york-city/",
            "url": "https://homeofficepolitics.com/weekend-jobs-new-york-city/",
            "title": "Weekend Jobs in New York City",
            "summary": "The glamour, the shows, the lights, and the prices! Living in New York City can be expensive from taxi fares to simple food and housing costs. That’s why, when in the Big Apple, a high paying job, a second job, or a side hustle or side gig, is a must-have. Placed just off the coast of the Northern Atlantic Ocean, New York is often considered cold in the winter and pleasant in the summer. The pillars of its economy are mostly real estate, health care, financial services, and new technology. Because there are almost 20 million people living in NYC, it stands to reason that there would be a huge demand for medical services. Another large market is real estate; with so many people in the city, housing continues to be built, sold, and rented at alarming costs. Not only are housing and medicine in high demand but also manufacturing. This may sound strange at first but New York is one of the U.S.’s major exporting locations of manufactured goods as well as popular clothing lines, glass, and other things like computers and mobile devices. New York City is also the main source of journalism, new media, and news throughout&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/40/weekend-jobs-new-york-city.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-08-30T15:47:36-06:00",
            "date_modified": "2021-08-30T16:52:28-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/your-guide-on-how-to-side-hustle-reddit/",
            "url": "https://homeofficepolitics.com/your-guide-on-how-to-side-hustle-reddit/",
            "title": "Your Guide on How to Side Hustle Reddit",
            "summary": "Reddit has become an indispensable tool for many people who ask questions and form discussions on many topics ranging from hobbies to professional careers, and from random trivia to experts coming together. Now, it is one of the largest spaces in the world wide web for almost anything and everything. You can get side hustles from Reddit. Because of its community-centric model, Reddit is the perfect place to build and grow your side hustle to make more money. The website is basically the largest collection of communities that helps you delve into your interests, hobbies, passions, and professional pursuits. It is another stomping ground where a lot of freelancers learn how to make money online. Interested in something? Reddit has a community for that! They are called “subreddits,” which carry their own community rules, themes, and expectations based on the people who interact in that community. Subreddits are what make the website valuable for generating your side hustle ideas. By posting or commenting on Reddit, your interactions can get upvotes or downvotes. The more upvotes you get, the more valuable you and your posts become to the subreddit. Getting side hustles from Reddit can become almost easy. If you can&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/39/how-to-side-hustle-reddit.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Side Hustle"
            ],
            "date_published": "2021-08-25T13:33:11-06:00",
            "date_modified": "2021-08-25T15:51:41-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/easy-remote-work-from-home-weekend-jobs/",
            "url": "https://homeofficepolitics.com/easy-remote-work-from-home-weekend-jobs/",
            "title": "Easy, Remote or Work From Home Weekend Jobs",
            "summary": "Many of us who want to make an extra source of income prefer part-time weekend jobs that allow us to do extra work only during Saturdays and Sundays. Part-time weekend jobs are great because many of us already have a day job, family, a small business we are just starting, or other full time responsibilities. Working on the weekends is both attractive, potentially rewarding financially, not stressful, and thus can be a great option. Now once we have blocked off our weekends with the objective of getting more money, where do we start looking for good weekend part time jobs? How do we identify the right weekend jobs that are suitable for us? There are actually five categories of weekend part-time jobs that we can look at, and then assess if we can do them, based on our own: skills, inclinations, interests, and resources. Remember that time should no longer be an issue in picking from these various weekend gigs. We have already set aside Saturday and Sunday for a side gig. Another thing to remember is that these are not full time jobs where we function as employees, but are part-time. Here are types of weekend work that can&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/38/easy-remote-work-from-home-weekend-jobs.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-08-24T14:32:00-06:00",
            "date_modified": "2021-08-30T10:33:19-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/15-side-hustle-gig-apps-earn-money/",
            "url": "https://homeofficepolitics.com/15-side-hustle-gig-apps-earn-money/",
            "title": "15 Side Hustle &amp; Gig Apps To Help You Earn More Money",
            "summary": "The side gig economy is thriving. According to brodmin, an independent global directory for uncollected invoices, states that the growth of the global gig economy is expected to reach $455 billion USD in 2023. So, I’ve got one question for you: How are you earning money with the side gig and side hustle economy? I’m guessing you haven’t started or haven’t gotten very far yet, so this is how I’d start making money from side hustles and side gigs...with Side Gig Apps. Many side gig and side hustle apps, regardless of platform, will prove to be very valuable to many freelancers and people who want to earn extra money on top of their regular day jobs. But which side gig apps will you use? We have classified the best side hustle and side gig apps based on the types of jobs available in their respective apps: Let the side gig hunt begin! ☝🏽 back to top. ☝🏽 back to top. The following apps are best for people who work on various jobs, ie. cleaning, home repairs, delivery, yard work, and more. If you’re an all-around handyman, this app is for you. TaskRabbit covers services from furniture mounting to assembly; cleaning;&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/37/15-side-hustle-gig-apps-make-money-2.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Side Gig",
                   "App"
            ],
            "date_published": "2021-08-23T12:34:12-06:00",
            "date_modified": "2021-08-23T14:36:37-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/do-i-work-from-home-or-sleep-at-the-office/",
            "url": "https://homeofficepolitics.com/do-i-work-from-home-or-sleep-at-the-office/",
            "title": "Do I Work From Home or Sleep at The Office?",
            "summary": "When you work from home you find yourself working from the laundry room, the kids' room, the park, garage, bathroom, and even even your car. The convenience to work anytime anywhere also makes it really difficult to get the work-life balance right. The location of your work from home desk for the day, is sometimes a matter of convenience or self-preservation. Sometimes you are looking for the place that gives you energy and focus, and other times you're forced to make do with what options you have. My wife and I got so used to trying to find a quiet place for phone calls and video conferencing meetings that you'd regularly find us sitting in the car in the garage. Sometimes her or I would walk throughout the entire house looking for the other person, and then without finding them, you'd finally resort to checking the garage. You would find the other person sitting in the car with no other lights on other than the glow of a screen from a phone or computer. ☝🏽 back to top. My favorite place to work is at home with my family, but I can't work in an atmosphere with six little kids all&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/36/Work-From-Home-Sleep-At-Office.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Work From Home",
                   "Memes"
            ],
            "date_published": "2021-08-18T15:18:33-06:00",
            "date_modified": "2021-08-23T14:34:55-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/part-time-on-demand-remote-weekend-jobs/",
            "url": "https://homeofficepolitics.com/part-time-on-demand-remote-weekend-jobs/",
            "title": "Part-time, On-demand, and Remote Weekend Jobs",
            "summary": "We all need the extra cash a side gig or a side hustle provides. But some people can’t seem to find the right mix of having a regular job and an extra side job. And those with a side job sometimes compromise their regular jobs which can impact their performance in both their day job and side job. Compromising both your day job and your side hustle shouldn’t happen. Why not find a weekend-only side job that will help augment your income without impacting your full-time job? You know that you will be all the better for keeping busy making money and, in a sense, have the best of both worlds. Let’s go over some of the benefits of a weekend-only job. First let’s talk about the benefits of a weekend job (which are the reasons why you do spend time working during this time instead of using them for recreation): But what types of weekend-only side jobs are there? We have identified three types: Part-time Weekend Jobs, On-demand Weekend Jobs, and Remote Weekend Work. ☝🏽 back to top. According to ZipRecruiter, “Part-time weekend jobs include positions that extend from weekdays into the weekend due to the company’s business hours,&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/35/restraunt-server-side-gig-sm.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-08-18T10:14:35-06:00",
            "date_modified": "2021-08-23T14:34:31-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/remote-jobs-you-can-do-on-weekends/",
            "url": "https://homeofficepolitics.com/remote-jobs-you-can-do-on-weekends/",
            "title": "Remote Jobs You Can Do on Weekends",
            "summary": "While you do have your regular 9-to-5 work, your income from your regular job may not be enough to reach your goal of enjoying a grand vacation or getting a new cushy car or paying off debt. A remote weekend job, a job that can be done on the weekend remotely from the comfort of your own home, can help you reach your goals faster. But do you have time for a job on the weekend when you have a regular day job? Of course, you do! Here are some remote weekend jobs you can take on that won’t affect your 9-to-5 job work week. ☝🏽 back to top. There are many remote weekend jobs that you can take on as a side gig. But if you want to work weekends, here are some remote gigs you can do on the weekend: While not exactly high-paying, survey participants earn at least $1 per survey. Online surveys proliferate the internet because many research companies are looking for online respondents. Payouts are usually in cash, gifts, virtual credit cards, or discounts, depending on the website or app. Being a survey participant can be a great gig if you don’t mind answering questions&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/34/audio-transcriptinoist-weekend-job-sm.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-08-02T13:30:22-06:00",
            "date_modified": "2021-08-02T22:22:25-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/highest-paying-side-gigs/",
            "url": "https://homeofficepolitics.com/highest-paying-side-gigs/",
            "title": "Highest-paying Side Gigs",
            "summary": "Having a side gig or, an extra way to make money, has been a blessing to many enterprising individuals and to those who need to supplement their incomes. Leveraging online technology for side gigs has now become an indispensable skill to make money no matter what stage you are in your career. If you want to earn more money to pay your bills or go on that dream vacation, then look for the highest paying side gigs that can raise your earnings. ☝🏽 back to top. As the gig economy matures, people are starting to rely on side gigs and side hustles to supplement their incomes. For the purposes of this article, we are going to make a difference between a side gig and a side hustle as they do have core differences that may make you prefer one over the other. A side hustle is a side job that usually involves something that you are passionate about. To make this work, you usually work for yourself as a freelancer or in your own company or brand, establishing your professional brand in the industry you are trying to break through. Examples of side hustles include creating a YouTube channel or&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/33/software-developer-side-gig.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Side Gig"
            ],
            "date_published": "2021-07-28T09:01:54-06:00",
            "date_modified": "2021-07-28T09:39:54-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/permanent-part-time-weekend-jobs/",
            "url": "https://homeofficepolitics.com/permanent-part-time-weekend-jobs/",
            "title": "Permanent Part-Time Weekend Jobs",
            "summary": "People choose to work weekend part-time jobs either instead of or in addition to weekday jobs. There are as many different types as there are preferences, and correspondingly different salary rates that are good earning jobs. But which weekend jobs are available or can turn into a regular permanent weekend job, should either the company or he or she choose that they want a permanent part-time weekend job? Part-time or full-time jobs differ in terms of hours rendered. While the Fair Labor Standards Act (FLSA) doesn’t provide a clear definition for either, most companies will require full-time employees to work somewhere between 32 and 40 hours per week. The Bureau of Labor Statistics also sets the benchmark for full-time employees a little higher at 35 hours a week. The range from casual to permanent refers to the employee’s employment status determined by his or her type of contract or employment situation. We will look at some jobs that are only available part-time AND on the weekends. The jobs below can also be done on the weekdays but they are also jobs that you can do on the weekend for various reasons. For example, you already have a day job, the&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/32/golf-caddy-weekend-job.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-07-21T14:03:22-06:00",
            "date_modified": "2021-07-28T09:14:56-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/6-highest-paying-jobs-without-a-degree/",
            "url": "https://homeofficepolitics.com/6-highest-paying-jobs-without-a-degree/",
            "title": "6 Highest Paying Jobs Without a Typical Degree",
            "summary": "Find a field or job that interests you. Study its course in college or university. Get that degree and high grades, if possible. Then apply at the biggest companies and known brands where you can get high paying jobs, charge the highest salaries at your level, and which should be commensurate with your degree. Does that all sound right and good? That used to be the standard formula for Americans. A college or university degree was the first major step to success. That’s why many parents bend over backwards, sometimes taking multiple jobs, to send their kids to college. These kids, who would be in their late teens during their freshman year, might also take part-time jobs like waiting tables or doing deliveries to help pay for their tuition fees. However, there has been an increasing re-examination of that so-called success formula. One reason is the crushing student loan, a debt that the average college kid owes the government for subsidizing his tuition, and will take him years for him to pay. CNBC made a report, citing the U.S. Department of Education’s 2020 figures, saying that the average 24-year-old American who finished college or university four years ago has a&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/31/commercial-pilot.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-07-20T16:37:12-06:00",
            "date_modified": "2021-07-28T09:13:42-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/i-hired-my-wife-as-our-social-media-manager-because-of-her-extensive-experience-scrolling/",
            "url": "https://homeofficepolitics.com/i-hired-my-wife-as-our-social-media-manager-because-of-her-extensive-experience-scrolling/",
            "title": "I hired my wife as our social media manager because of her extensive experience scrolling",
            "summary": "I generally only use social media for work purposes to promote products or make more business connections. However, my wife and I both love poking fun of and juxtaposing the difference between working in a traditional office setting compared to working from home. We make ourselves giggle as we come up with memes, slangs, comic strips and cartoons. The funny side of working from home helps us cope with raising a family, being self-employed, and working from home where we're never more than 50 feet away from each other. We can almost always see, hear, or even smell each other at all times. I know social media can be helpful to connect with likeminded types of people, or at least entertain other people. However, I'm not as funny as my wife and she likes social media more than I do. My wife uses social media as one of her favorite forms of entertainment, along with podcasts clean comedy videos (Jim Gaffigan, Brian Regan, Nate Bargatze, drybarcomedy.com, etc.) . Starting homeofficepolitics.com I've considered hiring a virtual assistant to help with promoting our content and satirical ideas via social media. However, my wife was offended that I'd ask someone else to do&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/30/I-hired-my-wife-as-my-social-media-manager-because-of-her-extensive-experience-with-scrolling-2.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Memes"
            ],
            "date_published": "2021-07-16T14:48:46-06:00",
            "date_modified": "2021-08-06T07:48:59-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/workingfromhome-gives-new-meaning-to-the-concept-of-open-office/",
            "url": "https://homeofficepolitics.com/workingfromhome-gives-new-meaning-to-the-concept-of-open-office/",
            "title": "#workingfromhome Gives New Meaning to the Concept of Open Office",
            "summary": " Remember when the concept of \"open office\" was the trendy office layout? Goodbye cubical walls, hello noise pollution! 📣 You used to hear Matt chronicling his weekend stories and you thought that was annoying! Now you've got several kids running around your office (the kitchen table) telling you about their nose bugs, tattle-telling that their sibling called them a mean name, and you can hear it all! We know it's hard to get any work done when the whole house is the office. Here are some ideas we've tried that might help you deal with noise and interruptions from working at home: Yes, you too can resort to these tactics of working from home and still sleep at night, we promise! #workfromhome #openoffice #workwithcrybabies ",
            "image": "https://homeofficepolitics.com/media/posts/29/Open-Office-2.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Memes"
            ],
            "date_published": "2021-07-16T11:57:23-06:00",
            "date_modified": "2021-07-28T00:12:00-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/weekend-jobs-for-college-students/",
            "url": "https://homeofficepolitics.com/weekend-jobs-for-college-students/",
            "title": "Weekend Jobs for College Students",
            "summary": "College can be one of the most difficult times in a person's life. Transitioning out of the house and away from parents presents new challenges. College students have to balance a social life with the endless amounts of homework, not to mention living with people you may have not chosen, and trying to figure out what you want to do for the rest of your life. Then there is the every present need for having enough money for everything. To help you with making money as a college student, here are weekend jobs only for college students that could make your life a little easier. If you find it difficult to find a job as a college student, here are some creative ways to get a job. ☝🏽 back to top. This is perhaps the easiest job you’ll find on this list of weekend jobs for college students. Donating plasma can give you a hefty check if you find a great deal and promotion. Yet even without those things, you can earn approximately $40-60 every week. In order to donate plasma, you must be well-hydrated and eat at least two hours before. Your blood has to have a certain percentage&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/28/college-student-tutoring.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-06-24T16:43:49-06:00",
            "date_modified": "2021-07-28T09:12:22-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/difference-between-side-hustle-side-gig/",
            "url": "https://homeofficepolitics.com/difference-between-side-hustle-side-gig/",
            "title": "The Difference Between a Side Hustle and a Side Gig",
            "summary": "Have you ever met someone who didn’t want to earn extra bucks? I haven’t! But the way that someone makes money from a side job (hustle or gig) can vary a lot depending on the person. Some people like the high-risk and high reward of starting and running their own business, while others like the low-risk and reliability of a second job. No matter what your preference, there is a difference between a side hustle and a side gig. Queue the rise of the gig economy, a labor market characterized by the prevalence of short-term contracts OR freelance work as opposed to permanent jobs. And many easy second side jobs that can supplement your income from your day job. A side job has two categories: the side hustle and the side gig. Both let you earn extra money, but knowing the difference between the two will help you choose which side job fits you best. ☝🏽 back to top. A side hustle is a side job that usually involves something that you are passionate about, and you usually work for yourself as a freelancer or in your own company or brand. Maddie is an example; she works in a bank&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/25/side-hustle-vs-side-gig.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Side Hustle",
                   "Side Gig"
            ],
            "date_published": "2021-06-21T23:34:58-06:00",
            "date_modified": "2021-07-28T00:06:01-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/12-creative-ways-to-find-or-get-a-job/",
            "url": "https://homeofficepolitics.com/12-creative-ways-to-find-or-get-a-job/",
            "title": "12 Creative Ways to FIND or GET a Job",
            "summary": "The pandemic has been bad news for some with the loss of jobs, but with the loss of jobs come new entrepreneurs who thrived in the pandemic and got new jobs. Pandemic or not, there is always an opportunity to make money when you see the opportunities instead of dwelling on the roadblocks. There are creative ways to find jobs too. In fact there are more jobs that opened during the pandemic if you know where to look, especially as economies in various states are opening and people are getting vaccinated. According to NBC News, job vacancies in the U.S. have risen to 5 million more than the job openings prior to the pandemic. With many people vying for specific job positions, the question now is, how do you get the job that’s right for you? How do you find your dream job and get chosen from among the number of people who want it as badly as you do? You do have your CV or resume, your experience, and your determination. All you need to do is find the job and secure your position. The problem with finding a job now is that there are so many job postings&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/27/12-creative-ways-find-get-job.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-06-21T22:34:13-06:00",
            "date_modified": "2021-08-20T13:43:14-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/easy-weekend-jobs-for-teens/",
            "url": "https://homeofficepolitics.com/easy-weekend-jobs-for-teens/",
            "title": "Easy Weekend Jobs for Teens",
            "summary": "As a teenager, it’s hard to find a job that will work around your busy school schedule. With six hours of school (or more) plus any extracurricular activities you have, along with finding time to socialize and go to fun events, getting and holding a job can be difficult. See also: 13 Ways to Make Money as a Teenager. But it is possible for teenagers like you to make a little money on the weekend. Here are great weekend jobs for teens with a busy schedule during the week. These are easy weekend jobs because they are readily available with hours strictly on the weekend. These easy weekend jobs for teens offer great pay for minimum commitment and low-qualification. These jobs are ones that any teenager would be able to get during a weekend. These weekend jobs for teens are going to be found more often around your neighborhood and with people you already know. These jobs are great because you have familiarity with those whom you’ll be working for. They’re also great weekend jobs because they’re easily done with the time a teenager has on the weekend. These could be odd jobs like cleaning homes or businesses with family&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/26/teenager-driving-weekend-job.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Jobs"
            ],
            "date_published": "2021-06-19T15:49:25-06:00",
            "date_modified": "2021-07-28T00:07:45-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/13-ways-make-money-teenager/",
            "url": "https://homeofficepolitics.com/13-ways-make-money-teenager/",
            "title": "13 Ways to Make Money as a Teenager",
            "summary": "Teens are getting to an age where they want to start making money. They often find more interest doing chores around the house for extra money, or doing odd jobs for family members. If you are interested in making money as a teen, here is some advice and a good list on where to get started. As your teenagers get older, we have 100 creative ways to make money. Official money-making for teens can begin at 12 years old, within legal boundaries. The younger the child is, the more likely they can only work for family members (parents). Federal law mandates 14 &amp; 15 year olds cannot work more than 8 hours a day or 40 hours a week, and not more than 3 hours a day or 18 hours a week on school days. If it's hard for teens to get time off during the weekday, then an easy weekend job might work better for their schedule. Restrictions for teens working are lifted once a teen turns 16. Nevertheless, minors (younger than 18) are not allowed to work before 7 a.m. nor after 7 p.m. Most of the jobs for teens pay around $10 per hour. Teens that are&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/24/jobs-teenagers-make-money-driving-960.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Make Money",
                   "Jobs"
            ],
            "date_published": "2021-06-02T12:52:12-06:00",
            "date_modified": "2021-07-28T00:02:17-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/save-money-live-better/",
            "url": "https://homeofficepolitics.com/save-money-live-better/",
            "title": "7 Tips On How to Save Money &amp; Live Better",
            "summary": "Walmart’s slogan---“save money live better”---is popular and catchy, but is it really possible to actually save money and live better? Beyond just shopping at Walmart, we will show you why and how you can save more money and also live a better. Saving money can be a source of happiness, not just security---because it will give you more money for other things you value. When you save money you also give yourself options. Options that can be a safety net or opportunities for investments in the future. Let’s take another look at the benefits and strategies of how to save money and live better. When financially challenging or uncertain times happen in our lives, these challenges present a good opportunity for us to save money and encourage us to look at creative ways to make more money. Saving money gives us options. If we lose a job or an important client, or face a major medical emergency, we will have hoped we were judicious in our spending. If we have a little savings we can be choosy about how we spend or invest that money. According to CNBC, nearly 40% of people said they’re shopping online every week, during a&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/23/save-money-live-better.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Save Money"
            ],
            "date_published": "2021-06-01T14:01:07-06:00",
            "date_modified": "2021-07-28T00:05:29-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/creative-ways-to-make-money/",
            "url": "https://homeofficepolitics.com/creative-ways-to-make-money/",
            "title": "100 Creative Ways to Make Money",
            "summary": "More and more people like you are looking for creative ways to make money. Gallup Great Jobs Survey in 2019 stated that 33% of the respondents work more than just one job for financial reasons; apparently one job is not enough to pay the bills or enough to help them reach their financial goals. What’s interesting is that a large portion of the respondents (48%) said that their reason for having a second job (a side gig) or starting their own business (a side hustle) is simply preference: they just do not want to rely on one source of income, period. To date, according to the U.S. Bureau of Labor Statistics, there are about 9.7 million Americans who have lost their jobs---and are looking for work. At the time of this publishing, that means that the unemployment rate in the United States stands at 6.0%. While the government is cautiously optimistic that this will go down to about 5% by the end of 2021, no one serious about their future and the welfare of their family will just wait for the good times to roll back in. Millennials and Gen-Z workers are experiencing difficult times finding work and satisfying work.",
            "image": "https://homeofficepolitics.com/media/posts/22/creative-ways-to-make-money.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Make Money",
                   "Creative"
            ],
            "date_published": "2021-05-31T13:48:27-06:00",
            "date_modified": "2021-07-28T00:04:59-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/easy-weekend-jobs/",
            "url": "https://homeofficepolitics.com/easy-weekend-jobs/",
            "title": "20 Easy Weekend Jobs",
            "summary": "Whether you have some time to kill or you want to earn some extra money, there are a lot of easy weekend jobs you can choose from. Weekend jobs can be hard to find until you know the right places to look. Some require more hours than others but all of them are worth the extra time and money you get in the end if you choose something you love. The following weekend jobs are easy because they have few requirements and deal more with common sense rather than trained skills or pure talent. These jobs are always available in any community and many even pay well above minimum wage if you find the right one. Weekend jobs are often ones that require you to spend more hours on them simply because you’ll need to catch up on the weeks worth of work, but they’re a great side gig because you’ll have the time to complete them efficiently and these weekend only jobs are often done best over the weekend. But why choose to spend them doing something you can’t have fun with? After all, you are sacrificing your weekend. So, here is a list of different but interesting weekend&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/21/brooke-cagle-8jp-6SjVibM-unsplash.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Make Money",
                   "Jobs"
            ],
            "date_published": "2021-05-29T15:25:44-06:00",
            "date_modified": "2021-07-28T00:04:15-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/creativity-business-entrepreneurship-making-money/",
            "url": "https://homeofficepolitics.com/creativity-business-entrepreneurship-making-money/",
            "title": "The Secret of Creativity in Business and Making Money",
            "summary": "Creativity is most often associated with artists such as painters, fashion designers, pottery makers, or generally people who like to make things. When “creativity” and “making money” are combined, someone usually thinks of artistic industries like selling artwork, advertising, selling artwork in museums, and possibly media or entertainment such as movies or television. However, creativity or business creativity is not limited to any business, industry, or person. Creativity can be found in any business, organization, project, and even hobby. The more creative you get the more successful you're likely to be. As an example, business creativity is like thinking of other ways to use math and arrive at the number 2. While most people would immediately say 1+1=2, creative problem solvers would be more thorough and answer 0+2, 4-2, 1*2, 2*1, 3-1, etc. to get to 2. Creative problem solvers know that there is more than one way to get to an answer. Being creative actually allows you to solve problems in new or novel ways. Creative thinking is one of the reasons why entrepreneurship is becoming so popular. With the number of gaps between problems and solutions in the world, entrepreneurs are seeing opportunities and can often move at&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/20/secret-creativity-business-making-money-banner.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Make Money",
                   "Creative"
            ],
            "date_published": "2021-05-27T09:55:40-06:00",
            "date_modified": "2021-08-27T11:25:40-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/10-creative-majors-degrees-educations-make-money/",
            "url": "https://homeofficepolitics.com/10-creative-majors-degrees-educations-make-money/",
            "title": "10 Creative Majors, Degrees, or Educations that Make Money",
            "summary": "You have heard the horror stories of the “starving artist” who just wants to pursue their passion but can’t afford to pay their rent, much less support his family. How does an artistic, creative person like you make sure you won’t go hungry pursuing your passion? How can you have fun learning, creating, and expressing yourself while also earning a living? If you are asking questions like these, you do have a valid and meaningful concern. While it’s true that a degree per-se does not qualify one for such jobs as much as hard smart work afterward does, earring the right degree or getting the right education does give you an early head start. There is power and money making opportunities with creative and artistic thinking. Education and training is like getting compounding interest on your money that continues to build and grow and pay you throughout your entire life. (share with the world) We took the time to research the most and high-paying artistic creative jobs, the creative majors, creative educations, and creative degrees that are behind the best creative and artistic jobs. Knowing your desired destination and each respective starting point, can lead to making reliable and realistic&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/19/creative-majors-design-education-make-money.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Make Money",
                   "Creative"
            ],
            "date_published": "2021-05-17T12:32:53-06:00",
            "date_modified": "2021-07-28T00:02:51-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/how-creative-thinking-leads-to-making-more-money/",
            "url": "https://homeofficepolitics.com/how-creative-thinking-leads-to-making-more-money/",
            "title": "How Improved Creative Thinking Leads to Making More Money",
            "summary": "I have been in the business of creative communications for more than 30 years. I started as an ad copywriter and now wear many different creative hats: I became an account manager, a layout artist, a creative director, a media planner, and a marketing communications consultant. I have learned how being more creative can lead to more opportunities to make money. So, whenever there’s an opportunity to improve my creativity and learn from new experiences, count me in. You might say that I am a creative person, and creative thinking comes naturally to me. But is creativity confined to people like me? What about people who don't consider themselves \"creative\" or artists? Can’t they be creative too? This is not an idle question that just stops at self-reflection. We (you and me) need to understand our creative gifts and the way that the creative process works, because improved creative thinking can lead us to making more money. (share with the world) There are real opportunities for creative people, especially professionals who have creative majors or degrees or education to make money. Many people think that creativity is something you have or you don’t. Thinking that only a certain people are&hellip;",
            "image": "https://homeofficepolitics.com/media/posts/18/creative-thinking-making-money-960-50.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Make Money",
                   "Creative"
            ],
            "date_published": "2021-05-17T10:19:20-06:00",
            "date_modified": "2021-08-25T15:51:31-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/about/",
            "url": "https://homeofficepolitics.com/about/",
            "title": "About Us",
            "summary": " We've been working online since 2002. We begun doing technical support and design services for an early ecommerce platform. Our first full-time work from home gig started in 2011 and we've been doing this ever since. We now manage five brands with a few dozen contractors. We've always thought we should chronicle our lives and experience working from home. We've had challenges, fun times, and love the puns all along the way. Follow us and we'll introduce you to how you can work from home on your own side hustle, time gig working for someone else, and save money too. ",
            "image": "https://homeofficepolitics.com/media/posts/1/about-home-office-politics-960-30-short.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "About"
            ],
            "date_published": "2021-04-14T13:56:30-06:00",
            "date_modified": "2021-07-28T00:13:41-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/about-you/",
            "url": "https://homeofficepolitics.com/about-you/",
            "title": "About You",
            "summary": " We want to know more about you. Tell us what you want to achieve? Do you want to make more more money, save money, start a side hustle or get side gig? What challenges are you experiencing? What would help you achieve these goals? If we can help, we will get back to you with more information and resources. Loading…",
            "image": "https://homeofficepolitics.com/media/posts/2/about-you-960-50.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "Resources"
            ],
            "date_published": "2021-04-14T13:55:52-06:00",
            "date_modified": "2021-07-28T00:13:32-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/contact/",
            "url": "https://homeofficepolitics.com/contact/",
            "title": "Contact Us",
            "summary": " Send us an email by completing the form below. No spam please. Loading… ",
            "image": "https://homeofficepolitics.com/media/posts/3/contact-hop-960.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "About"
            ],
            "date_published": "2021-04-14T13:55:10-06:00",
            "date_modified": "2021-07-28T00:13:20-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/tcp/",
            "url": "https://homeofficepolitics.com/tcp/",
            "title": "Terms, Conditions, Privacy, etc.",
            "summary": " The terms \"us\", \"we\", \"HOP\", etc. represent Home Office Politics. The terms \"you\", \"viewer\", \"visitor\", etc. represent you. Our service, tools and information is provided as-is with no warranty. We will do our best to provide you great information and tools and keep them available as much as possible. We reserve the right to limit access to our resources at our sole discretion.&nbsp; We reserve the right to use the content, data and tools at our disposal for our advantage as long as it is good and legal. Data provided to us via form submissions is used for customer service, assessment, and marketing purposes. The&nbsp;content on HomeOfficePolitics.com may contain affiliate links, meaning we&nbsp;receive payment if you decide to make a purchase or sign up through our links, at no cost to you. Please use our links to help support everything we are trying to do for you and our community. ",
            "image": "https://homeofficepolitics.com/media/posts/6/terms-conditions-privacy.jpg",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "About"
            ],
            "date_published": "2021-04-14T13:49:36-06:00",
            "date_modified": "2021-07-28T00:12:43-06:00"
        },
        {
            "id": "https://homeofficepolitics.com/write-for-us/",
            "url": "https://homeofficepolitics.com/write-for-us/",
            "title": "Write for Us",
            "summary": " We love working with other authors and people experienced with making money, saving money, working from home, remote jobs, side hustles, side gigs and personal finance. Please complete this form if you have something you would like to contribute or if you want to work together. We love reciprocating links, articles, etc. Fees may apply. Don't get overwhelmed here, this is more common sense and is easy if you write quality content. Submit your content. Thank you. ",
            "image": "https://homeofficepolitics.com/media/posts/4/write-for-hop-960.webp",
            "author": {
                "name": "Garth"
            },
            "tags": [
                   "About"
            ],
            "date_published": "2021-04-06T12:07:49-06:00",
            "date_modified": "2021-07-28T00:13:09-06:00"
        }
    ]
}
